In [1]:
from utils.query_db import db_connection

### **`COUNT`** function

Acts like a function only, counts the number or rows in a specifict column.

In [2]:
with db_connection() as conn:
    conn.fetch_all("""SELECT COUNT(first_name) FROM actor;""")

   count
0    200

Possible to specify `*` as a parameter to return the number of rows in the table. It's the same as specifying a specific column.

In [3]:
with db_connection() as conn:
    conn.fetch_all("""SELECT COUNT(*) FROM actor;""")

   count
0    200

Can be nested with **`DISTINCT`**.

In [4]:
with db_connection() as conn:
    conn.fetch_all("""SELECT COUNT(DISTINCT(first_name)) from actor;""")

   count
0    128

In [5]:
with db_connection() as conn:
    conn.fetch_all("""SELECT COUNT(DISTINCT(amount)) from payment;""")

   count
0     19

### **`MIN`** aggregate function

In [6]:
with db_connection() as conn:
    conn.fetch_all("""SELECT MIN(replacement_cost) 
                      FROM film;""")

    min
0  9.99

### **`MAX`** aggregate function

In [7]:
with db_connection() as conn:
    conn.fetch_all("""SELECT MAX(replacement_cost) 
                      FROM film;""")

     max
0  29.99

You can chain several aggregate functions together.

In [8]:
with db_connection() as conn:
    conn.fetch_all("""SELECT MIN(replacement_cost),
                             MAX(replacement_cost),
                             COUNT(replacement_cost)
                      FROM film;""")

    min    max  count
0  9.99  29.99   1000

### **`AVG`** aggregate function

In [9]:
with db_connection() as conn:
    conn.fetch_all("""SELECT AVG(replacement_cost)
                      FROM film;""")

                   avg
0  19.9840000000000000

**`ROUND`** function rounds the floating point values to fewer significant digits.

In [10]:
with db_connection() as conn:
    conn.fetch_all("""SELECT ROUND(AVG(replacement_cost), 2)
                      FROM film;""")

   round
0  19.98

### **`SUM`** aggregate function

In [11]:
with db_connection() as conn:
    conn.fetch_all("""SELECT SUM(replacement_cost)
                      FROM film;""")

        sum
0  19984.00